Revit 2027 API
FamilyManager.SetParameterLocked Method
 For Conceptual Mass and Curtain Panel families, lock or unlock a dimension-driving parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetParameterLocked(
	FamilyParameter familyParameter,
	bool locked
)
Public Sub SetParameterLocked (
	familyParameter As FamilyParameter,
	locked As Boolean
)
public:
void SetParameterLocked(
	FamilyParameter^ familyParameter,
	bool locked
)
member SetParameterLocked :
        familyParameter : FamilyParameter *
        locked : bool -> unit
Parameters
familyParameter FamilyParameter
locked Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if this family is not a Conceptual Mass or Curtain Panel family.
ArgumentException |  Thrown if the parameter is not lockable.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace